# Viscosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidTemperature..::..Viscosity Property
FluidTemperature Class See Also
---
The dynamic viscosity value
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Viscosity { get; set; }
```

Visual Basic
---
```text
Public Property Viscosity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Viscosity {
	double get ();
	void set (double value);
}
```

# See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace